FLOORS_LIST = [
    ("1floor", "1 этаж"),
    ("2floor", "2 этаж"),
]

BUILDINGS_LIST = [
    ("4building", "4 корпус"),
    ("5building", "5 корпус"),
    ("6building", "6 корпус"),
]

CATEGORIES_LIST = [
    ("1cat", "1 - Двухкомнатный номер на 1 этаже в 4 корпусе с удобствами в номере"),
    ("2cat", "2 - Двухместный номер на 1 этаже в 4 корпусе с удобствами в блоке"),
    ("3cat", "3 - Двухместный номер на 1 этаже в 4 корпусе с удобствами в номере"),
    ("4cat", "4 - Одноместный номер на 1 этаже в 4 корпусе с удобствами в номере"),
    ("5cat", "5 - Двухместный номер на 2 этаже в 4 корпусе с удобствами в блоке"),
    ("6cat", "6 - Двухместный номер на 1 этаже в 6 корпусе с удобствами в номере"),
    ("7cat", "7 - Двухместный номер на 2 этаже в 6 корпусе с удобствами в номере"),
]

ROOM_TYPES_LIST = [
    ("in_room", "Удобства в номере"),
    ("in_block", "Удобства в блоке"),
]

TOUR_TYPES_LIST = [
    ("social", "Социальная путевка по контракту (льгота)"),
    ("usual", "Обычная путевка за свои деньги"),
    ("therapy", "Только лечение"),
    ("hotel", "Только проживание"),
]

BOOKING_STATUSES_LIST = [
    ("free", "Свободно"),
    ("book", "Забронировано"),
    ("prepay", "Внесена предоплата"),
    ("fullpay", "Полностью оплачен"),
    ("occupied", "Заселен"),
]

GENDER_PERSON_LIST = [
    ("male", "Мужской"),
    ("female", "Женский"),
]

GENDER_ROOM_LIST = [
    ("male", "Мужской"),
    ("female", "Женский"),
    ("undefined", "Не указан"),
]